<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.CitrixWorkspace</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Internet</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Citrix</string>
		<key>NAME</key>
		<string>CitrixWorkspace</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Citrix Workspace</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>The new Citrix Workspace app gives users a great experience—a secure, contextual, unified workspace—on any device. Give teams instant access to all their SaaS and web apps, files, mobile apps, Citrix Virtual Apps and Desktops from an easy-to-use, all-in-one interface powered by Citrix Workspace services.</string>
			<key>developer</key>
			<string>Citrix Systems, Inc.</string>
			<key>display_name</key>
			<string>Citrix Workspace</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.CitrixWorkspace</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>io.github.hjuutilainen.download.CitrixWorkspace</key>
			<dict>
				<key>git_hash</key>
				<string>0d24d3b15b82b7adc5f5d406208614d7a06e8905</string>
				<key>path</key>
				<string>~/work/autopkg-ci/repos/com.github.autopkg.hjuutilainen-recipes/CitrixReceiver/CitrixWorkspace.download.recipe</string>
				<key>sha256_hash</key>
				<string>35954b97f508648d46dd4b368226a13742a53d4015d0aba9d3c94564cf2ac929</string>
			</dict>
			<key>io.github.hjuutilainen.munki.CitrixWorkspace</key>
			<dict>
				<key>git_hash</key>
				<string>99e914d80b7fb36d0cb4a033b79d3a3c0d618b32</string>
				<key>path</key>
				<string>~/work/autopkg-ci/repos/com.github.autopkg.hjuutilainen-recipes/CitrixReceiver/CitrixWorkspace.munki.recipe</string>
				<key>sha256_hash</key>
				<string>a5ca7d742e3c655de185f2473d10f5415fd2397b1a9697aef1a986141f2446ef</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
