<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.TextMate2</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/TextMate2</string>
		<key>NAME</key>
		<string>TextMate2</string>
		<key>PRERELEASE</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>TextMate brings Apple's approach to operating systems into the world of text editors. By bridging UNIX underpinnings and GUI, TextMate cherry-picks the best of both worlds to the benefit of expert scripters and novice users alike.</string>
			<key>display_name</key>
			<string>TextMate 2</string>
			<key>minimum_os_version</key>
			<string>10.12</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
[ -d /usr/local/bin ] || mkdir -p /usr/local/bin
/bin/cp -f -p /Applications/TextMate.app/Contents/Resources/mate /usr/local/bin/mate
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
[ -e /usr/local/bin/mate ] &amp;&amp; rm -f /usr/local/bin/mate
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.TextMate2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.TextMate2</key>
			<dict>
				<key>git_hash</key>
				<string>98f630b7d95121fe3db0f7b432cf58d0d34716c1</string>
				<key>path</key>
				<string>~/work/autopkg-ci/repos/com.github.autopkg.recipes/TextMate/TextMate2.download.recipe</string>
				<key>sha256_hash</key>
				<string>0b3921208c88504de6b0698be259b93c1f55d263096fd54c8629d9940a1427f5</string>
			</dict>
			<key>com.github.autopkg.munki.TextMate2</key>
			<dict>
				<key>git_hash</key>
				<string>6323748fb9a141a5de948a63dd8707e8c28b7697</string>
				<key>path</key>
				<string>~/work/autopkg-ci/repos/com.github.autopkg.recipes/TextMate/TextMate2.munki.recipe</string>
				<key>sha256_hash</key>
				<string>240d0f5d35c30f7349f7fac85fd16cb686ca93b576fd50a8371b9e3ad4c50b91</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
